/*****************************************************************************\                                                                                                                                                       *                                                                *                                                                                                                                                        *
'                       PROPRIETARY PROGRAM MATERIAL
'
'   This material is proprietary to Momentum Systems  and is not to be  
'   reproduced, used or disclosed except in accordance with program 
'   license or upon written authorization of
'       Momentum Systems ,
'       41 Twosome Dr Suite #9,
'       Moorestown NJ 08057.
'
'   COPYRIGHT (C) 1997  MOMENTUM SYSTEMS
'   All Rights Reserved
'   MOMENTUM PROPRIETARY
'
'******************************************************************************\
'                                          DISCLAIMER
'
'   The within information is not intended to be nor should such be construed 
'   as an affirmation of fact, representation or warranty by and the related 
'   materials are only furnished pursuant and subject to the terms and 
'   conditions of a duly executed license agreement.  The only warranties made 
'   by Momentum systems with respect to the products described in this material
'   are set forth in the above furnished mentioned agreement.
'
'   The customer should exercise care to assure that use of the software will be in
'   full compliance with laws, rules and regulations of the jurisdictions with 
'   respect to which it is used.
'
'*******************************************************************************
 
'*******************************************************************************
'
'    Product      :  AFD 
'    Module       :  AFD QueueManager Service
'    Date         :  March 1998
'
'    File Name    :  QMQueueObj.cpp
'
'    Purpose      :  This file has the code for all the QueueManager queuing,
'                    scheduling, storing on disk, etc. functions for the
'                    AfdQueueManager.
'
'    Author       :  AA
'******************************************************************************/
/*Modification History
9/Jul	AA	Added function RemoveKeyedQueueEntry().
			Fixed errors in the function RemoveQueueEntry().
5/Aug	AA	Fixed error in H_RewriteMarkedQueueEntry().
17/Aug/1998	AA	Added Larry's changes in UpdateQueueInformation(). LIMS
*/

#include "basic.h"
#include <stddef.h>
#include "build.h"
#include "RqStruct.h"
#include <AfdMisc.h>
#include "QMErcs.h"
#include "Trace.h"
#include <stdio.h>

static char *ModId[]={__FILE__};

#define MAXQUEUESALLOWED  256
#define MAXSERVERS  64
#define MAXSERVERSLESS1  63
#define MAXQUEUEDSERVERS  64
#define MAXQUEUEDSERVERSLESS1  63

#define MAX_ENTRIES_QUEUE 4096

#define EXTEND_QUANTUM 10

#define Q_VERSION 0x41414141
#define PAGE_SIZE 512
#define QE_SIGNATURE 0x534d494c

extern BOOL WriteLogData(char *data, DWORD level = 0);

#pragma pack(2)

typedef struct QueueEntry_s {
	QueueEntry_s *Next;
	DWORD signature;
	WORD priority;
	ctosDateTimeType dateTime;
	WORD repeatInterval;
	DWORD eh;
	DWORD markUserNum;
	WORD iEntry;
	WORD iNext;
	WORD iPrev;
	DWORD padding;
	WORD cEntry;			//not really required
	BYTE rgEntry[1];
} QueueEntry_t;


typedef struct QueueHeader_s {
	QueueHeader_s *Next; //4
    DWORD version;  //8
    WORD queueType;	 //10		
	WORD cbQueueName; //12
	char QueueName[52]; //64
	WORD cbFileName; //66
	char FileName[92]; //158
	DWORD sEntrySize; //162
	DWORD fileSize; //166
	WORD cEntries; //168
	WORD iEntryFirst; //170
	WORD iEntryLast; //172
	//from here on the information is going to be built at Init;
	HANDLE qh;							//queuehandle allocated at run time
	DWORD *pEntryMap;					//a bit map indicating available entries
	WORD sEntryMap;
    BOOL fStable;									
    BOOL fUniqueSvr;			
    WORD cServers;						//number of servers for this queue
    DWORD rgQueueServers[MAXSERVERS];	//userNum of the Queue servers
	WORD cQueuedRequests;
    RqMarkNextQueueEntry_t *rgQueuedRequests[MAXQUEUEDSERVERS]; //Mark...() rqs pending
	QueueEntry_t *pMarkedQueues;
	WORD cActiveEntries;
	QueueEntry_t *pActiveQueues;
	WORD cTimedEntries;					//number of timed cQDEntries
	QueueEntry_t *pTimedQueues;
	WORD nFetches;						//TO_DO, add this
    ctosDateTimeType EarliestTime;			
	//size = 730
	char padding[294];					//to bring it up to 1024 bytes
} QueueHeader_t;

#define EH_ACTIVEQUEUEMASK 0x80000000
#define EH_TIMEDQUEUEMASK  0x40000000
#define EH_MARKEDQUEUEMASK 0x20000000
